app/controllers/profiles_controller.rb

  def new
    @profile = Profile.where(user_id:current_user.id)
    if @profile.present?
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @profile = Profile.new(profile_params)
    @profile.user_id = current_user.id
    puts "***********************"
      puts params[:image_id]
      puts  "**********************"
    if params[:image_id].present?
      preloaded = Cloudinary::PreloadedFile.new(params[:image_id])
      raise "Invalid upload signature" if !preloaded.valid?
      @profile.image_id = preloaded.identifier
    end
    respond_to do |format|
      if @profile.save
---
INSERT INTO "profiles" ("user_id", "bio", "username", "created_at", "updated_at", "image_id") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 2], ["bio", "haahah"], ["username", "haha"], ["created_at", "2018-04-29 04:45:33.693630"], ["updated_at", "2018-04-29 04:45:33.693630"], ["image_id", 0]]

  def update
    if params[:image_id].present?
      preloaded = Cloudinary::PreloadedFile.new(params[:image_id])
      raise "Invalid upload signature" if !preloaded.valid?
      puts "***********************"
      puts preloaded.identifier
      puts  "**********************"
      @profile.image_id = preloaded.identifier
      @profile.save
---
UPDATE "profiles" SET "avatar_file_name" = ?, "avatar_content_type" = ?, "avatar_file_size" = ?, "avatar_updated_at" = ?, "updated_at" = ? WHERE "profiles"."id" = ?

    def set_profile
      @profile = Profile.where(user_id:current_user.id).first
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ? ORDER BY "profiles"."id" ASC LIMIT ?  [["user_id", 2], ["LIMIT", 1]]