app/views/layouts/_nav.html.erb

                    <% if current_user.present? %>
                    <% if current_user.profile.present? %>
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]